# s/~ \\|~/ \\parallel /g
# s/>-</"=/g
s/([^\\])_/\1\\_/g
s/\>-\</"=/g
s/^[  \t]*(---|—|—|—|–)[  ]/"--* /g
s/( | |\t)+([—–-]) /\~"--- /g
# s/([ \t\n]*\-{1,3}) /\~"--- /g

# [[:alpha:]] --- то же самое, что и [[:upper:][:lower:]]
# s/(\<[[:alpha:]]\.)[\~ ]([[:alpha:]]]\.)@=/\1\\,\2/g
# s/(\<[[:alpha:]]\.)/\1\~/g
# s/(\<[[:alpha:]][,]*) /\1\~/g

s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z]\.)[\~  ]([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюяA-Za-z]\.)@=/\1\\,\2/g
s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя]\.)(\.)@!/\1\~/g
s/(\<[АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя][,]*)[  ]/\1\~/g


# s/([[:upper:]]{4,})/\\textsc\{\1\}/g
# s/[[:upper:]]{4,}/\L\u&/g
# Сработало не только в Vim'е!

s/…/.../g
s/^[ \t]*\*([ \t]\*){2}[ \t]*$/\\textstars/g

# В Vim:
# %s/\v[[:upper:]]{4,}/\L\u&/gc
